In [2]:
import pandas as pd
import numpy as np
from numpy import integer

df = pd.DataFrame(np.arange(0,20).reshape(5,4), index=['Row1','Row2','Row3','Row4','Row5'], columns=['Column1','Column2','Column3','Column4'])
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [4]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [5]:
df.to_csv('practice.csv')

In [6]:
df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [8]:
df.iloc[1,2]

6

In [9]:
df.iloc[1:,2:]

      Column3  Column4
Row2        6        7
Row3       10       11
Row4       14       15
Row5       18       19

In [10]:
#CONVERT TO DATAFRAME TO ARRAT

df.iloc[:,2:].values

array([[ 2,  3],
       [ 6,  7],
       [10, 11],
       [14, 15],
       [18, 19]])

In [11]:
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [12]:
df.iloc[:,2:].values.shape

(5, 2)

In [13]:
df.iloc[:,2:].value_counts()

Column3  Column4
2        3          1
6        7          1
10       11         1
14       15         1
18       19         1
Name: count, dtype: int64

In [14]:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [17]:
df['Column1'].unique()

array([ 0,  4,  8, 12, 16])

In [18]:
df['Column2']

Row1     1
Row2     5
Row3     9
Row4    13
Row5    17
Name: Column2, dtype: int32

In [31]:
import os
print(os.path.exists('E:\\MCA\\Python\\Python_Practice\\Mercedesbenz.csv'))

True

In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('C:\\Users\\SUDEEP\\Downloads\\merc.csv')

In [4]:
df

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize
0,SLK,2005,5200,Automatic,63000,Petrol,325,32.1,1.8
1,S Class,2017,34948,Automatic,27000,Hybrid,20,61.4,2.1
2,SL CLASS,2016,49948,Automatic,6200,Petrol,555,28.0,5.5
3,G Class,2016,61948,Automatic,16000,Petrol,325,30.4,4.0
4,G Class,2016,73948,Automatic,4000,Petrol,325,30.1,4.0
...,...,...,...,...,...,...,...,...,...
13114,C Class,2020,35999,Automatic,500,Diesel,145,55.4,2.0
13115,B Class,2020,24699,Automatic,2500,Diesel,145,55.4,2.0
13116,GLC Class,2019,30999,Automatic,11612,Diesel,145,41.5,2.1
13117,CLS Class,2019,37990,Automatic,2426,Diesel,145,45.6,2.0
13118,S Class,2019,54999,Automatic,2075,Diesel,145,52.3,2.9

In [5]:
df.isnull().sum()

model           0
year            0
price           0
transmission    0
mileage         0
fuelType        0
tax             0
mpg             0
engineSize      0
dtype: int64

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13119 entries, 0 to 13118
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   model         13119 non-null  object
 1   year          13119 non-null  int64
 2   price         13119 non-null  int64
 3   transmission  13119 non-null  object
 4   mileage       13119 non-null  int64
 5   fuelType      13119 non-null  object
 6   tax           13119 non-null  int64
 7   mpg           13119 non-null  float64
 8   engineSize    13119 non-null  float64
dtypes: float64(2), int64(4), object(3)
memory usage: 922.6+ KB

In [7]:
df.describe()

,year,price,mileage,tax,mpg,engineSize
count,13119.000000,13119.000000,13119.000000,13119.000000,13119.000000,13119.000000
mean,2017.296288,24698.596920,21949.559037,129.972178,55.155843,2.071530
std,2.224709,11842.675542,21176.512267,65.260286,15.220082,0.572426
min,1970.000000,650.000000,1.000000,0.000000,1.100000,0.000000
25%,2016.000000,17450.000000,6097.500000,125.000000,45.600000,1.800000
50%,2018.000000,22480.000000,15189.000000,145.000000,56.500000,2.000000
75%,2019.000000,28980.000000,31779.500000,145.000000,64.200000,2.100000
max,2020.000000,159999.000000,259000.000000,580.000000,217.300000,6.200000

In [11]:
test_df = pd.read_csv('practice.csv', sep=';') #here we use the separator to read the data
test_df

      ,Column1  Column2  Column3  Column4
Row1         0        1        2        3
Row2         4        5        6        7
Row3         8        9       10       11
Row4        12       13       14       15
Row5        16       17       18       19

In [12]:
test_df.head()

      ,Column1  Column2  Column3  Column4
Row1         0        1        2        3
Row2         4        5        6        7
Row3         8        9       10       11
Row4        12       13       14       15
Row5        16       17       18       19

In [15]:
df.value_counts()

model       year  price  transmission  mileage  fuelType  tax  mpg   engineSize
 A Class    2020  25879  Semi-Auto     1000     Petrol    145  53.3  1.3           36
 GLA Class  2019  24999  Semi-Auto     1000     Diesel    145  64.2  2.1            8
 GLC Class  2020  49980  Semi-Auto     3999     Petrol    145  26.4  3.0            7
 A Class    2020  24889  Semi-Auto     1000     Diesel    145  62.8  1.5            7
                  25729  Semi-Auto     1000     Petrol    145  53.3  1.3            6
                                                                                   ..
 C Class    2017  18490  Automatic     8060     Petrol    150  50.4  2.0            1
                         Semi-Auto     25584    Petrol    145  50.4  2.0            1
                                       46430    Diesel    150  61.4  2.1            1
                  18491  Semi-Auto     18390    Petrol    145  50.4  2.0            1
230         2007  4500   Automatic     94000    Petrol    520  29.4  0.0            1
Name: count, Length: 12860, dtype: int64

In [19]:
df['year']<2020

0         True
1         True
2         True
3         True
4         True
         ...
13114    False
13115    False
13116     True
13117     True
13118     True
Name: year, Length: 13119, dtype: bool

In [18]:
df[df['year'] >= 2020]

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize
10,A Class,2020,32980,Automatic,606,Petrol,145,35.8,2.0
11,A Class,2020,26980,Automatic,1000,Diesel,145,62.8,1.5
33,A Class,2020,28128,Automatic,2563,Petrol,145,47.9,1.3
38,C Class,2020,31790,Automatic,3500,Petrol,145,64.2,2.0
57,GLE Class,2020,48995,Automatic,3000,Diesel,145,36.7,2.0
...,...,...,...,...,...,...,...,...,...
13053,A Class,2020,27995,Automatic,2500,Diesel,145,67.3,1.5
13056,GLE Class,2020,58450,Automatic,1159,Diesel,150,32.8,2.9
13113,C Class,2020,30999,Automatic,1000,Diesel,145,64.2,2.0
13114,C Class,2020,35999,Automatic,500,Diesel,145,55.4,2.0
13115,B Class,2020,24699,Automatic,2500,Diesel,145,55.4,2.0

In [4]:
#CSV

from io import StringIO, BytesIO

In [21]:
data = ('col1,col2,col3\n'
        'x,y,1\n'
        'a,b,2\n'
        'c,d,3')

In [22]:
data

'col1,col2,col3\nx,y,1\na,b,2\nc,d,3'

In [23]:
type(data)

str

In [24]:
pd.read_csv(StringIO(data)) #stringIO converts to dataframe

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [26]:
df = pd.read_csv(StringIO(data), usecols=['col1', 'col3'])
df

  col1  col3
0    x     1
1    a     2
2    c     3

In [27]:
df.to_csv('data_set')

In [28]:
df = pd.read_csv(StringIO(data), dtype=object)
df

  col1 col2 col3
0    x    y    1
1    a    b    2
2    c    d    3

In [33]:
df['col1']

0    x
1    a
2    c
Name: col1, dtype: object

In [7]:
data = ('a,b,c\n'
        '4,apple,bat,5.7\n'
        )

In [9]:
import pandas as pd

pd.read_csv(StringIO(data), index_col=False)

C:\Users\SUDEEP\AppData\Local\Temp\ipykernel_20444\3963695022.py:3: ParserWarning: Length of header or names does not match length of data. This leads to a loss of data with index_col=False.
  pd.read_csv(StringIO(data), index_col=False)

   a      b    c
0  4  apple  bat